common/models/User.php

SELECT * FROM `t_user` WHERE (`username`='alilinet') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);