app/userapi/models/LoginForm.php

    public function login()
    {
        if ($this->validate()) {
            $accessToken = $this->_user->generateAccessToken(time()+2400);
            $ipaddress = new ipaddress();
			//下面更新用户登录相关信息
			$this->_user->last_login_date = time();
			$this->_user->last_login_ip = Yii::$app->request->getRemoteIP();
			$this->_user->last_login_address = $ipaddress->getIpAddress($this->_user->last_login_ip);
            $this->_user->save();
---
UPDATE `t_user` SET `access_token`='FbhE3pWP1v09fzQHRkUF8dGkcc1Oo4QP_1591869708', `last_login_date`=1591867308, `last_login_ip`='127.0.0.1', `last_login_address`='本机地址', `updated_at`=1591867308 WHERE `id`=1